app/controllers/posts_controller.rb

  def update_likes
    # TODO need to get the page_name from the AJAX call and update that enrtry in the database
    puts 'ok so the page name is...'
    puts "The param has page_name: #{params[:page_name]}"
    page_name = params[:page_name]
    curr_likes = ArticleStatistic.where(page_name: page_name).first.likes + 1
    my_symb = page_name.parameterize.underscore.to_sym
    # puts permit_params
    ArticleStatistic.where(page_name: page_name).first.update(likes: curr_likes)
---
SELECT  "article_statistics".* FROM "article_statistics" WHERE "article_statistics"."page_name" = ? ORDER BY "article_statistics"."id" ASC LIMIT ?  [["page_name", "About"], ["LIMIT", 1]]
UPDATE "article_statistics" SET "likes" = ?, "updated_at" = ? WHERE "article_statistics"."id" = ?  [["likes", 1], ["updated_at", "2018-09-15 23:39:09.963703"], ["id", 1]]

  def intro
    page_name = 'About'
    @likes = ArticleStatistic.where({ page_name: page_name }).first[:likes]
---
SELECT  "article_statistics".* FROM "article_statistics" WHERE "article_statistics"."page_name" = ? ORDER BY "article_statistics"."id" ASC LIMIT ?  [["page_name", "About"], ["LIMIT", 1]]

  def first_post
    page_name = 'First Post'
    @likes = ArticleStatistic.where({ page_name: page_name }).first[:likes]
---
SELECT  "article_statistics".* FROM "article_statistics" WHERE "article_statistics"."page_name" = ? ORDER BY "article_statistics"."id" ASC LIMIT ?  [["page_name", "First Post"], ["LIMIT", 1]]

  def new_home
    page_name = 'New Home'
    @likes = ArticleStatistic.where({ page_name: page_name }).first[:likes]
---
SELECT  "article_statistics".* FROM "article_statistics" WHERE "article_statistics"."page_name" = ? ORDER BY "article_statistics"."id" ASC LIMIT ?  [["page_name", "New Home"], ["LIMIT", 1]]

  def zero_waste_101
    page_name = 'Zero Waste 101'
    @likes = ArticleStatistic.where({ page_name: page_name }).first[:likes]
---
SELECT  "article_statistics".* FROM "article_statistics" WHERE "article_statistics"."page_name" = ? ORDER BY "article_statistics"."id" ASC LIMIT ?  [["page_name", "Zero Waste 101"], ["LIMIT", 1]]

  def california
    page_name = 'California Roadtrip'
    @likes = ArticleStatistic.where({ page_name: page_name }).first[:likes]
---
SELECT  "article_statistics".* FROM "article_statistics" WHERE "article_statistics"."page_name" = ? ORDER BY "article_statistics"."id" ASC LIMIT ?  [["page_name", "California Roadtrip"], ["LIMIT", 1]]

  def suicide_prevention
    page_name = 'Suicide Prevention'
    @likes = ArticleStatistic.where({ page_name: page_name }).first[:likes]
---
SELECT  "article_statistics".* FROM "article_statistics" WHERE "article_statistics"."page_name" = ? ORDER BY "article_statistics"."id" ASC LIMIT ?  [["page_name", "Suicide Prevention"], ["LIMIT", 1]]

  def eating_to_fight_climate_change
    page_name = 'Eating to Fight Climate Change'
    @likes = ArticleStatistic.where({ page_name: page_name }).first[:likes]
---
SELECT  "article_statistics".* FROM "article_statistics" WHERE "article_statistics"."page_name" = ? ORDER BY "article_statistics"."id" ASC LIMIT ?  [["page_name", "Eating to Fight Climate Change"], ["LIMIT", 1]]

  def what_to_do_about_climate_change
    page_name = 'What to Do About Climate Change'
    @likes = ArticleStatistic.where({ page_name: page_name }).first[:likes]
---
SELECT  "article_statistics".* FROM "article_statistics" WHERE "article_statistics"."page_name" = ? ORDER BY "article_statistics"."id" ASC LIMIT ?  [["page_name", "What to Do About Climate Change"], ["LIMIT", 1]]